#pragma once
#include<iostream>
#include<string>
using namespace std;









//W  大部分界面输出类
class playerr
{
	string number;
	int time;
	int sum;

public:

	playerr( string s="-----", int a = 0, int b = 0) :number(s), time(a), sum(b) {}
	void display();
	string getnumber();
	int gettime();
	int getsum();
	void putnumber(string a);
	void puttime(int b);
	void putsum(int c);
	playerr(const playerr& a);
	void maindisplay();
	void setdisplay();
	void putgame();
	void delwdd();
	void delwd();
	void wchwrong();
	void chcs();
	void gaidc();
};   
void playerr::gaidc() {
	cout << "\n\n\n\n\n\n\n\n\n\n\n";
	cout <<" ******************************************      1、继续修改单词          *********************************************\n" << endl;
	cout << "******************************************        2、返回设置            *********************************************\n" << endl;
	cout << "******************************************        3、返回主菜单          *********************************************\n" << endl;
	cout << endl << endl;
	cout << "                                                 请选择：";
}

void playerr::chcs() {
	cout << "\n\n\n\n\n\n\n\n\n\n\n";
	cout << "******************************************      1、返回单词数量选择      *********************************************\n" << endl;
	cout << "******************************************          2、返回设置          *********************************************\n" << endl;
	cout << "******************************************         3、返回主菜单         *********************************************\n" << endl;
	cout << endl << endl;
	cout << "                                                 请选择：";

}
void playerr::wchwrong() {
	cout << "\n\n\n\n\n\n\n\n\n\n\n";
	cout <<" *******************************************     1、返回猜错次数设置       ********************************************\n" << endl;
	cout << "*******************************************         2、返回设置           ********************************************\n" << endl;
	cout << "*******************************************         3、返回主菜单         ********************************************\n" << endl;
	cout << endl << endl;
	cout << "                                                 请选择：";

}
void playerr::delwd() {
	cout << "\n\n\n\n\n\n\n\n\n\n\n";
	cout << "**********************************************   1、继续删除单词    **************************************************\n" << endl;
	cout << "**********************************************     2、返回设置      **************************************************\n" << endl;
	cout << "**********************************************    3、返回主菜单     **************************************************\n" << endl;
	cout << endl << endl;
	cout << "                                                 请选择：";
}

void playerr::delwdd() {
	cout << "\n\n\n\n\n\n\n\n\n\n\n";
	cout <<"***********************************************   1、继续添加单词    **************************************************\n" << endl;
	cout <<"***********************************************    2、返回设置       **************************************************\n" << endl;
	cout <<"***********************************************   3、返回主菜单      **************************************************\n" << endl;
	cout << endl << endl;
	cout << "                                                 请选择：";

}
void playerr::putgame() {
	cout << endl << endl;
	cout << "******************************************        1、重新开始            *********************************************" << endl << endl;
	cout << "******************************************       2、返回主菜单           *********************************************" << endl << endl;
	cout << "                                                 请选择：";

}
/*输出主界面*/
void playerr::maindisplay() {
	cout << "TIP:请输入序号并按回车键以选择" << endl;
	cout << endl << endl;
	cout << endl << endl;
	cout << endl << endl;
	cout << "-------------------------------------------------------猜单词游戏-------------------------------------------------------" << endl;
	cout << endl << endl;
	cout << endl << endl;
	cout << endl << endl;
	cout << "************************************************       1、开始游戏      ************************************************" << endl;
	cout << endl << endl;
	cout << "************************************************       2、查看排名      ************************************************" << endl;
	cout << endl << endl;
	cout << "************************************************       3、游戏设置      ************************************************" << endl;
	cout << endl << endl;
	cout << "************************************************       4、退出游戏      ************************************************" << endl;
	cout << endl << endl << endl;
	cout << "                                                         请选择：";

}

/*输出设置界面*/
void playerr::setdisplay() {
	cout << "TIP:请输入序号并按回车键以选择" << endl;
	cout << endl << endl;
	cout << endl << endl;
	cout << "---------------------------------------------------------设置-----------------------------------------------------------" << endl;
	cout << endl << endl;
	cout << endl << endl;
	cout << "****************************************       1、每次猜的单词数量设置      ********************************************" << endl;
	cout << endl << endl;
	cout << "****************************************         2、允许猜错次数设置        ********************************************" << endl;
	cout << endl << endl;
	cout << "****************************************             3、添加单词            ********************************************" << endl;
	cout << endl << endl;
	cout << "****************************************             4、修改单词            ********************************************" << endl;
	cout << endl << endl;
	cout << "****************************************             5、删除单词            ********************************************" << endl;
	cout << endl << endl;
	cout << "****************************************             6、返回主菜单          ********************************************" << endl;
	cout << endl;
	cout << "                                                         请选择：";

}

playerr::playerr(const playerr& a) {
	number = a.number;
	time = a.time;
	sum = a.sum;
};
void playerr::display()
{

	cout << "单词库的总单词量:" << ends << sum << endl;
}
string playerr::getnumber() {
	return number;
}
int playerr::gettime() {
	return time;
}
int playerr::getsum() {
	return sum;
}
void playerr::putnumber(string a) {
	number = a;
}
void playerr::puttime(int b) {
	time = b;
}
void playerr::putsum(int c) {
	sum = c;
}